# Practical 4:

AIM : Exploring Pandas Library to perform Various Tasks for Data Handling, Wrangling , Cleaning, Description, Arrangement on selected two datasets

In [35]:
import pandas as pd
import numpy as np

In [36]:
df=pd.read_csv('Downloads/Customer_Mall.csv')
df.head()

   CustomerID  Gender  Age  Annual Income (k$)  Spending Score (1-100)
0           1    Male   19                  15                      39
1           2    Male   21                  15                      81
2           3  Female   20                  16                       6
3           4  Female   23                  16                      77
4           5  Female   31                  17                      40

In [37]:
df.describe()

       CustomerID         Age  Annual Income (k$)  Spending Score (1-100)
count  200.000000  200.000000          200.000000              200.000000
mean   100.500000   38.850000           60.560000               50.200000
std     57.879185   13.969007           26.264721               25.823522
min      1.000000   18.000000           15.000000                1.000000
25%     50.750000   28.750000           41.500000               34.750000
50%    100.500000   36.000000           61.500000               50.000000
75%    150.250000   49.000000           78.000000               73.000000
max    200.000000   70.000000          137.000000               99.000000

In [38]:
df.columns

Index(['CustomerID', 'Gender', 'Age', 'Annual Income (k$)',
       'Spending Score (1-100)'],
      dtype='object')

In [39]:
df.shape

(200, 5)

In [40]:
df.dtypes

CustomerID                 int64
Gender                    object
Age                        int64
Annual Income (k$)         int64
Spending Score (1-100)     int64
dtype: object

In [41]:
dfn = df.convert_dtypes()
dfn.dtypes

CustomerID                 Int64
Gender                    string
Age                        Int64
Annual Income (k$)         Int64
Spending Score (1-100)     Int64
dtype: object

In [42]:
data=df[['Age','Gender','Annual Income (k$)','Spending Score (1-100)']]
data.head()

   Age  Gender  Annual Income (k$)  Spending Score (1-100)
0   19    Male                  15                      39
1   21    Male                  15                      81
2   20  Female                  16                       6
3   23  Female                  16                      77
4   31  Female                  17                      40

In [43]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 200 entries, 0 to 199
Data columns (total 5 columns):
 #   Column                  Non-Null Count  Dtype
---  ------                  --------------  -----
 0   CustomerID              200 non-null    int64
 1   Gender                  200 non-null    object
 2   Age                     200 non-null    int64
 3   Annual Income (k$)      200 non-null    int64
 4   Spending Score (1-100)  200 non-null    int64
dtypes: int64(4), object(1)
memory usage: 7.9+ KB

In [44]:
df.sort_values("Age",axis=0,ascending=True,inplace=True)
df.head()

     CustomerID  Gender  Age  Annual Income (k$)  Spending Score (1-100)
114         115  Female   18                  65                      48
91           92    Male   18                  59                      41
65           66    Male   18                  48                      59
33           34    Male   18                  33                      92
0             1    Male   19                  15                      39

In [45]:
df.isna().head()

     CustomerID  Gender    Age  Annual Income (k$)  Spending Score (1-100)
114       False   False  False               False                   False
91        False   False  False               False                   False
65        False   False  False               False                   False
33        False   False  False               False                   False
0         False   False  False               False                   False

In [46]:
df.isna().sum()

CustomerID                0
Gender                    0
Age                       0
Annual Income (k$)        0
Spending Score (1-100)    0
dtype: int64

In [47]:
df.isna().any()

CustomerID                False
Gender                    False
Age                       False
Annual Income (k$)        False
Spending Score (1-100)    False
dtype: bool

In [48]:
df.empty

False

In [49]:
df.memory_usage()

Index                     1600
CustomerID                1600
Gender                    1600
Age                       1600
Annual Income (k$)        1600
Spending Score (1-100)    1600
dtype: int64

In [50]:
df.memory_usage(deep=True)

Index                      1600
CustomerID                 1600
Gender                    12424
Age                        1600
Annual Income (k$)         1600
Spending Score (1-100)     1600
dtype: int64

In [51]:
data2=df[['Annual Income (k$)','Spending Score (1-100)']]
gr=data2.groupby(['Annual Income (k$)'],as_index=False).mean()
gr.head()

   Annual Income (k$)  Spending Score (1-100)
0                  15                    60.0
1                  16                    41.5
2                  17                    58.0
3                  18                    50.0
4                  19                    47.0

In [52]:
data3=df[['Age','Gender','Annual Income (k$)','Spending Score (1-100)']]
gr=data3.groupby(['Gender'],as_index=False).mean()
gr.head()

   Gender        Age  Annual Income (k$)  Spending Score (1-100)
0  Female  38.098214           59.250000               51.526786
1    Male  39.806818           62.227273               48.511364

In [53]:
df['Annual Income (k$)'].value_counts()

54     12
78     12
60      6
87      6
62      6
       ..
61      2
126     2
59      2
58      2
15      2
Name: Annual Income (k$), Length: 64, dtype: int64

In [54]:
print(pd.pivot_table(df,index=['Annual Income (k$)']))

                      Age  CustomerID  Spending Score (1-100)
Annual Income (k$)
15                  20.00         1.5                    60.0
16                  21.50         3.5                    41.5
17                  26.50         5.5                    58.0
18                  29.00         7.5                    50.0
19                  49.00        10.5                    47.0
...                   ...         ...                     ...
103                 35.75       190.5                    48.5
113                 35.50       193.5                    49.5
120                 41.00       195.5                    47.5
126                 38.50       197.5                    51.0
137                 31.00       199.5                    50.5

[64 rows x 3 columns]

In [55]:
age_morethan_50=df.where(df['Age']>=50)
age_morethan_50.reset_index()

,index,CustomerID,Gender,Age,Annual Income (k$),Spending Score (1-100)
0,114,NaN,NaN,NaN,NaN,NaN
1,91,NaN,NaN,NaN,NaN,NaN
2,65,NaN,NaN,NaN,NaN,NaN
3,33,NaN,NaN,NaN,NaN,NaN
4,0,NaN,NaN,NaN,NaN,NaN
...,...,...,...,...,...,...
195,90,91.0,Female,68.0,59.0,55.0
196,108,109.0,Male,68.0,63.0,43.0
197,57,58.0,Male,69.0,44.0,46.0
198,70,71.0,Male,70.0,49.0,55.0
199,60,61.0,Male,70.0,46.0,56.0